# PasteInvisibleInView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..PasteInvisibleInView Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Selection is invisible in this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PasteInvisibleInView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PasteInvisibleInView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PasteInvisibleInView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace